"use client";
import * as React from "react";
import { Stack, Container, Typography } from "@mui/material";
import GreenStarCom from "@/components/GreenStarCom";
function Page() {
  return (
    <Stack>
      <Container maxWidth="lg">
        <Stack py={2} gap={3}>
          <GreenStarCom title=" Нууцлалын бодлого" />
          <Stack sx={{ textIndent: "50px" }}>
            <Typography
              textAlign={"justify"}
              fontSize={18}
              fontWeight={400}
              color={"#000"}
              lineHeight={"30px"}
              sx={{ textIndent: "50px" }}
            >
              Mstars Food delivery нь Mstars Lab компанийн интернэт худалдааны
              албан ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг вэбсайтаар
              үйлчлүүлэх, худалдан авалт хийхтэй холбоотой үүсэх харилцааг
              зохицуулахад оршино. Энэхүү нөхцөл нь хэрэглэгч худалдан авалт
              хийх, вэбсайтаар үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч
              баталгаажуулсаны үндсэн дээр хэрэгжинэ.
              <br /> Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab
              /цаашид байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/
              хамтран хяналт тавина. <br /> Mstars Food delivery нь Mstars Lab
              компанийн интернэт худалдааны албан ёсны вэбсайт бөгөөд энэхүү
              нөхцөл, журам нь уг вэбсайтаар үйлчлүүлэх, худалдан авалт хийхтэй
              холбоотой үүсэх харилцааг зохицуулахад оршино. <br />
              Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
              үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
              хэрэгжинэ. Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab
              /цаашид байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/
              хамтран хяналт тавина. <br />
              Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
              үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
              хэрэгжинэ. <br /> Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars
              Lab /цаашид байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч
              гэх/ хамтран хяналт тавина. <br /> Mstars Food delivery нь Mstars
              Lab компанийн интернэт худалдааны албан ёсны вэбсайт бөгөөд энэхүү
              нөхцөл, журам нь уг вэбсайтаар үйлчлүүлэх, худалдан авалт хийхтэй
              холбоотой үүсэх харилцааг зохицуулахад оршино. Энэхүү нөхцөл нь
              хэрэглэгч худалдан авалт хийх, вэбсайтаар үйлчлүүлэхээсээ өмнө
              хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр хэрэгжинэ. <br />{" "}
              Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид
              байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран
              хяналт тавина. <br />
              Mstars Food delivery нь Mstars Lab компанийн интернэт худалдааны
              албан ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг вэбсайтаар
              үйлчлүүлэх, худалдан авалт хийхтэй холбоотой үүсэх харилцааг
              зохицуулахад оршино. <br /> Энэхүү нөхцөл нь хэрэглэгч худалдан
              авалт хийх, вэбсайтаар үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч
              баталгаажуулсаны үндсэн дээр хэрэгжинэ. <br /> Энэхүү үйлчилгээний
              нөхцлийн хэрэгжилтэнд MStars Lab /цаашид байгууллага гэх/ болон
              хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт тавина. <br />{" "}
              Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
              үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
              хэрэгжинэ. <br /> Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars
              Lab /цаашид байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч
              гэх/ хамтран хяналт тавина.
            </Typography>
          </Stack>
        </Stack>
      </Container>
    </Stack>
  );
}
export default Page;
